Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_bf.h
/**
 * \file IfxDom_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:16:04 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Dom_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Dom_Registers
 * 
 */
#ifndef IFXDOM_BF_H
#define IFXDOM_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dom_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_OFF (2u)

/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_OFF (4u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P0 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P0_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P0 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P0_MSK (0x0u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P0 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P0_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P1 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P1_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P1 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P1_MSK (0x0u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P1 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P1_OFF (1u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P2 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P2_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P2 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P2_MSK (0x0u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P2 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P2_OFF (2u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P3 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P3_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P3 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P3_MSK (0x0u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P3 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P3_OFF (3u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P4 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P4_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P4 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P4_MSK (0x0u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P4 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P4_OFF (4u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P5 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P5_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P5 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P5_MSK (0x0u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P5 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P5_OFF (5u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P6 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P6_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P6 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P6_MSK (0x0u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P6 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P6_OFF (6u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P7 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P7_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P7 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P7_MSK (0x0u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI_P7 */
#define IFX_DOM_SCICTRL_PRIORITY_MCI_P7_OFF (7u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.HPRS */
#define IFX_DOM_SCICTRL_PRIORITY_HPRS_LEN (3u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.HPRS */
#define IFX_DOM_SCICTRL_PRIORITY_HPRS_MSK (0x7u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.HPRS */
#define IFX_DOM_SCICTRL_PRIORITY_HPRS_OFF (16u)

/** \brief Length for Ifx_DOM_SCICTRL_ERRADDR_Bits.ADDR */
#define IFX_DOM_SCICTRL_ERRADDR_ADDR_LEN (32u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERRADDR_Bits.ADDR */
#define IFX_DOM_SCICTRL_ERRADDR_ADDR_MSK (0xfffffffu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERRADDR_Bits.ADDR */
#define IFX_DOM_SCICTRL_ERRADDR_ADDR_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.RD */
#define IFX_DOM_SCICTRL_ERR_RD_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.RD */
#define IFX_DOM_SCICTRL_ERR_RD_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.RD */
#define IFX_DOM_SCICTRL_ERR_RD_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.WR */
#define IFX_DOM_SCICTRL_ERR_WR_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.WR */
#define IFX_DOM_SCICTRL_ERR_WR_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.WR */
#define IFX_DOM_SCICTRL_ERR_WR_OFF (1u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.SVM */
#define IFX_DOM_SCICTRL_ERR_SVM_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.SVM */
#define IFX_DOM_SCICTRL_ERR_SVM_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.SVM */
#define IFX_DOM_SCICTRL_ERR_SVM_OFF (2u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.OPC */
#define IFX_DOM_SCICTRL_ERR_OPC_LEN (4u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.OPC */
#define IFX_DOM_SCICTRL_ERR_OPC_MSK (0xfu)

