Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_bf.h
/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.OPC */
#define IFX_DOM_SCICTRL_ERR_OPC_OFF (4u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.TR_ID */
#define IFX_DOM_SCICTRL_ERR_TR_ID_LEN (8u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.TR_ID */
#define IFX_DOM_SCICTRL_ERR_TR_ID_MSK (0xffu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.TR_ID */
#define IFX_DOM_SCICTRL_ERR_TR_ID_OFF (8u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.ADDR_EDC */
#define IFX_DOM_SCICTRL_ERR_ADDR_EDC_LEN (8u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.ADDR_EDC */
#define IFX_DOM_SCICTRL_ERR_ADDR_EDC_MSK (0xffu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.ADDR_EDC */
#define IFX_DOM_SCICTRL_ERR_ADDR_EDC_OFF (16u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.MCI_SBS */
#define IFX_DOM_SCICTRL_ERR_MCI_SBS_LEN (8u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.MCI_SBS */
#define IFX_DOM_SCICTRL_ERR_MCI_SBS_MSK (0xffu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.MCI_SBS */
#define IFX_DOM_SCICTRL_ERR_MCI_SBS_OFF (24u)

/** \brief Length for Ifx_DOM_ID_Bits.MOD_REV */
#define IFX_DOM_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_DOM_ID_Bits.MOD_REV */
#define IFX_DOM_ID_MOD_REV_MSK (0x0u)

/** \brief Offset for Ifx_DOM_ID_Bits.MOD_REV */
#define IFX_DOM_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_DOM_ID_Bits.MOD_TYPE */
#define IFX_DOM_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_DOM_ID_Bits.MOD_TYPE */
#define IFX_DOM_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_DOM_ID_Bits.MOD_TYPE */
#define IFX_DOM_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_DOM_ID_Bits.MOD_NUMBER */
#define IFX_DOM_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_DOM_ID_Bits.MOD_NUMBER */
#define IFX_DOM_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_DOM_ID_Bits.MOD_NUMBER */
#define IFX_DOM_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI0 */
#define IFX_DOM_PESTAT_PESCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI0 */
#define IFX_DOM_PESTAT_PESCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI0 */
#define IFX_DOM_PESTAT_PESCI0_OFF (16u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI1 */
#define IFX_DOM_PESTAT_PESCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI1 */
#define IFX_DOM_PESTAT_PESCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI1 */
#define IFX_DOM_PESTAT_PESCI1_OFF (17u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI2 */
#define IFX_DOM_PESTAT_PESCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI2 */
#define IFX_DOM_PESTAT_PESCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI2 */
#define IFX_DOM_PESTAT_PESCI2_OFF (18u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI3 */
#define IFX_DOM_PESTAT_PESCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI3 */
#define IFX_DOM_PESTAT_PESCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI3 */
#define IFX_DOM_PESTAT_PESCI3_OFF (19u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI4 */
#define IFX_DOM_PESTAT_PESCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI4 */
#define IFX_DOM_PESTAT_PESCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI4 */
#define IFX_DOM_PESTAT_PESCI4_OFF (20u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI5 */
#define IFX_DOM_PESTAT_PESCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI5 */
#define IFX_DOM_PESTAT_PESCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI5 */
#define IFX_DOM_PESTAT_PESCI5_OFF (21u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI6 */
#define IFX_DOM_PESTAT_PESCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI6 */
#define IFX_DOM_PESTAT_PESCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI6 */
#define IFX_DOM_PESTAT_PESCI6_OFF (22u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI7 */
#define IFX_DOM_PESTAT_PESCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI7 */
#define IFX_DOM_PESTAT_PESCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI7 */
#define IFX_DOM_PESTAT_PESCI7_OFF (23u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI8 */
#define IFX_DOM_PESTAT_PESCI8_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI8 */
#define IFX_DOM_PESTAT_PESCI8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI8 */
#define IFX_DOM_PESTAT_PESCI8_OFF (24u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI9 */
#define IFX_DOM_PESTAT_PESCI9_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI9 */
#define IFX_DOM_PESTAT_PESCI9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI9 */
#define IFX_DOM_PESTAT_PESCI9_OFF (25u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI10 */
#define IFX_DOM_PESTAT_PESCI10_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI10 */
#define IFX_DOM_PESTAT_PESCI10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI10 */
#define IFX_DOM_PESTAT_PESCI10_OFF (26u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI11 */
#define IFX_DOM_PESTAT_PESCI11_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI11 */
#define IFX_DOM_PESTAT_PESCI11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI11 */
#define IFX_DOM_PESTAT_PESCI11_OFF (27u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI12 */
#define IFX_DOM_PESTAT_PESCI12_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI12 */
#define IFX_DOM_PESTAT_PESCI12_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI12 */
#define IFX_DOM_PESTAT_PESCI12_OFF (28u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI13 */
#define IFX_DOM_PESTAT_PESCI13_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI13 */
#define IFX_DOM_PESTAT_PESCI13_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI13 */
#define IFX_DOM_PESTAT_PESCI13_OFF (29u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI14 */
#define IFX_DOM_PESTAT_PESCI14_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI14 */
#define IFX_DOM_PESTAT_PESCI14_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI14 */
#define IFX_DOM_PESTAT_PESCI14_OFF (30u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI15 */
#define IFX_DOM_PESTAT_PESCI15_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI15 */
#define IFX_DOM_PESTAT_PESCI15_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI15 */
#define IFX_DOM_PESTAT_PESCI15_OFF (31u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI0 */
#define IFX_DOM_TIDSTAT_TIDSCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI0 */
#define IFX_DOM_TIDSTAT_TIDSCI0_MSK (0x1u)

