Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_bf.h
/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI0 */
#define IFX_DOM_TIDSTAT_TIDSCI0_OFF (0u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI1 */
#define IFX_DOM_TIDSTAT_TIDSCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI1 */
#define IFX_DOM_TIDSTAT_TIDSCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI1 */
#define IFX_DOM_TIDSTAT_TIDSCI1_OFF (1u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI2 */
#define IFX_DOM_TIDSTAT_TIDSCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI2 */
#define IFX_DOM_TIDSTAT_TIDSCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI2 */
#define IFX_DOM_TIDSTAT_TIDSCI2_OFF (2u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI3 */
#define IFX_DOM_TIDSTAT_TIDSCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI3 */
#define IFX_DOM_TIDSTAT_TIDSCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI3 */
#define IFX_DOM_TIDSTAT_TIDSCI3_OFF (3u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI4 */
#define IFX_DOM_TIDSTAT_TIDSCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI4 */
#define IFX_DOM_TIDSTAT_TIDSCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI4 */
#define IFX_DOM_TIDSTAT_TIDSCI4_OFF (4u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI5 */
#define IFX_DOM_TIDSTAT_TIDSCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI5 */
#define IFX_DOM_TIDSTAT_TIDSCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI5 */
#define IFX_DOM_TIDSTAT_TIDSCI5_OFF (5u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI6 */
#define IFX_DOM_TIDSTAT_TIDSCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI6 */
#define IFX_DOM_TIDSTAT_TIDSCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI6 */
#define IFX_DOM_TIDSTAT_TIDSCI6_OFF (6u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI7 */
#define IFX_DOM_TIDSTAT_TIDSCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI7 */
#define IFX_DOM_TIDSTAT_TIDSCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI7 */
#define IFX_DOM_TIDSTAT_TIDSCI7_OFF (7u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI8 */
#define IFX_DOM_TIDSTAT_TIDSCI8_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI8 */
#define IFX_DOM_TIDSTAT_TIDSCI8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI8 */
#define IFX_DOM_TIDSTAT_TIDSCI8_OFF (8u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI9 */
#define IFX_DOM_TIDSTAT_TIDSCI9_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI9 */
#define IFX_DOM_TIDSTAT_TIDSCI9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI9 */
#define IFX_DOM_TIDSTAT_TIDSCI9_OFF (9u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI10 */
#define IFX_DOM_TIDSTAT_TIDSCI10_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI10 */
#define IFX_DOM_TIDSTAT_TIDSCI10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI10 */
#define IFX_DOM_TIDSTAT_TIDSCI10_OFF (10u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI11 */
#define IFX_DOM_TIDSTAT_TIDSCI11_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI11 */
#define IFX_DOM_TIDSTAT_TIDSCI11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI11 */
#define IFX_DOM_TIDSTAT_TIDSCI11_OFF (11u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI12 */
#define IFX_DOM_TIDSTAT_TIDSCI12_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI12 */
#define IFX_DOM_TIDSTAT_TIDSCI12_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI12 */
#define IFX_DOM_TIDSTAT_TIDSCI12_OFF (12u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI13 */
#define IFX_DOM_TIDSTAT_TIDSCI13_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI13 */
#define IFX_DOM_TIDSTAT_TIDSCI13_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI13 */
#define IFX_DOM_TIDSTAT_TIDSCI13_OFF (13u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI14 */
#define IFX_DOM_TIDSTAT_TIDSCI14_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI14 */
#define IFX_DOM_TIDSTAT_TIDSCI14_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI14 */
#define IFX_DOM_TIDSTAT_TIDSCI14_OFF (14u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI15 */
#define IFX_DOM_TIDSTAT_TIDSCI15_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI15 */
#define IFX_DOM_TIDSTAT_TIDSCI15_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI15 */
#define IFX_DOM_TIDSTAT_TIDSCI15_OFF (15u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI0 */
#define IFX_DOM_TIDSTAT_TIDMCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI0 */
#define IFX_DOM_TIDSTAT_TIDMCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI0 */
#define IFX_DOM_TIDSTAT_TIDMCI0_OFF (16u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI1 */
#define IFX_DOM_TIDSTAT_TIDMCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI1 */
#define IFX_DOM_TIDSTAT_TIDMCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI1 */
#define IFX_DOM_TIDSTAT_TIDMCI1_OFF (17u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI2 */
#define IFX_DOM_TIDSTAT_TIDMCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI2 */
#define IFX_DOM_TIDSTAT_TIDMCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI2 */
#define IFX_DOM_TIDSTAT_TIDMCI2_OFF (18u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI3 */
#define IFX_DOM_TIDSTAT_TIDMCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI3 */
#define IFX_DOM_TIDSTAT_TIDMCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI3 */
#define IFX_DOM_TIDSTAT_TIDMCI3_OFF (19u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI4 */
#define IFX_DOM_TIDSTAT_TIDMCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI4 */
#define IFX_DOM_TIDSTAT_TIDMCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI4 */
#define IFX_DOM_TIDSTAT_TIDMCI4_OFF (20u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI5 */
#define IFX_DOM_TIDSTAT_TIDMCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI5 */
#define IFX_DOM_TIDSTAT_TIDMCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI5 */
#define IFX_DOM_TIDSTAT_TIDMCI5_OFF (21u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI6 */
#define IFX_DOM_TIDSTAT_TIDMCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI6 */
#define IFX_DOM_TIDSTAT_TIDMCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI6 */
#define IFX_DOM_TIDSTAT_TIDMCI6_OFF (22u)

