Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_bf.h
/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDMCI7 */
#define IFX_DOM_TIDSTAT_TIDMCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDMCI7 */
#define IFX_DOM_TIDSTAT_TIDMCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDMCI7 */
#define IFX_DOM_TIDSTAT_TIDMCI7_OFF (23u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI0 */
#define IFX_DOM_TIDEN_ENSCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI0 */
#define IFX_DOM_TIDEN_ENSCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI0 */
#define IFX_DOM_TIDEN_ENSCI0_OFF (0u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI1 */
#define IFX_DOM_TIDEN_ENSCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI1 */
#define IFX_DOM_TIDEN_ENSCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI1 */
#define IFX_DOM_TIDEN_ENSCI1_OFF (1u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI2 */
#define IFX_DOM_TIDEN_ENSCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI2 */
#define IFX_DOM_TIDEN_ENSCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI2 */
#define IFX_DOM_TIDEN_ENSCI2_OFF (2u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI3 */
#define IFX_DOM_TIDEN_ENSCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI3 */
#define IFX_DOM_TIDEN_ENSCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI3 */
#define IFX_DOM_TIDEN_ENSCI3_OFF (3u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI4 */
#define IFX_DOM_TIDEN_ENSCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI4 */
#define IFX_DOM_TIDEN_ENSCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI4 */
#define IFX_DOM_TIDEN_ENSCI4_OFF (4u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI5 */
#define IFX_DOM_TIDEN_ENSCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI5 */
#define IFX_DOM_TIDEN_ENSCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI5 */
#define IFX_DOM_TIDEN_ENSCI5_OFF (5u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI6 */
#define IFX_DOM_TIDEN_ENSCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI6 */
#define IFX_DOM_TIDEN_ENSCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI6 */
#define IFX_DOM_TIDEN_ENSCI6_OFF (6u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI7 */
#define IFX_DOM_TIDEN_ENSCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI7 */
#define IFX_DOM_TIDEN_ENSCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI7 */
#define IFX_DOM_TIDEN_ENSCI7_OFF (7u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI8 */
#define IFX_DOM_TIDEN_ENSCI8_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI8 */
#define IFX_DOM_TIDEN_ENSCI8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI8 */
#define IFX_DOM_TIDEN_ENSCI8_OFF (8u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI9 */
#define IFX_DOM_TIDEN_ENSCI9_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI9 */
#define IFX_DOM_TIDEN_ENSCI9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI9 */
#define IFX_DOM_TIDEN_ENSCI9_OFF (9u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI10 */
#define IFX_DOM_TIDEN_ENSCI10_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI10 */
#define IFX_DOM_TIDEN_ENSCI10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI10 */
#define IFX_DOM_TIDEN_ENSCI10_OFF (10u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI11 */
#define IFX_DOM_TIDEN_ENSCI11_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI11 */
#define IFX_DOM_TIDEN_ENSCI11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI11 */
#define IFX_DOM_TIDEN_ENSCI11_OFF (11u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI12 */
#define IFX_DOM_TIDEN_ENSCI12_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI12 */
#define IFX_DOM_TIDEN_ENSCI12_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI12 */
#define IFX_DOM_TIDEN_ENSCI12_OFF (12u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI13 */
#define IFX_DOM_TIDEN_ENSCI13_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI13 */
#define IFX_DOM_TIDEN_ENSCI13_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI13 */
#define IFX_DOM_TIDEN_ENSCI13_OFF (13u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI14 */
#define IFX_DOM_TIDEN_ENSCI14_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI14 */
#define IFX_DOM_TIDEN_ENSCI14_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI14 */
#define IFX_DOM_TIDEN_ENSCI14_OFF (14u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI15 */
#define IFX_DOM_TIDEN_ENSCI15_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI15 */
#define IFX_DOM_TIDEN_ENSCI15_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI15 */
#define IFX_DOM_TIDEN_ENSCI15_OFF (15u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI0 */
#define IFX_DOM_TIDEN_ENMCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI0 */
#define IFX_DOM_TIDEN_ENMCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI0 */
#define IFX_DOM_TIDEN_ENMCI0_OFF (16u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI1 */
#define IFX_DOM_TIDEN_ENMCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI1 */
#define IFX_DOM_TIDEN_ENMCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI1 */
#define IFX_DOM_TIDEN_ENMCI1_OFF (17u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI2 */
#define IFX_DOM_TIDEN_ENMCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI2 */
#define IFX_DOM_TIDEN_ENMCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI2 */
#define IFX_DOM_TIDEN_ENMCI2_OFF (18u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI3 */
#define IFX_DOM_TIDEN_ENMCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI3 */
#define IFX_DOM_TIDEN_ENMCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI3 */
#define IFX_DOM_TIDEN_ENMCI3_OFF (19u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI4 */
#define IFX_DOM_TIDEN_ENMCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI4 */
#define IFX_DOM_TIDEN_ENMCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI4 */
#define IFX_DOM_TIDEN_ENMCI4_OFF (20u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI5 */
#define IFX_DOM_TIDEN_ENMCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI5 */
#define IFX_DOM_TIDEN_ENMCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI5 */
#define IFX_DOM_TIDEN_ENMCI5_OFF (21u)

