Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_bf.h
/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI6 */
#define IFX_DOM_TIDEN_ENMCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI6 */
#define IFX_DOM_TIDEN_ENMCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI6 */
#define IFX_DOM_TIDEN_ENMCI6_OFF (22u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI7 */
#define IFX_DOM_TIDEN_ENMCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI7 */
#define IFX_DOM_TIDEN_ENMCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI7 */
#define IFX_DOM_TIDEN_ENMCI7_OFF (23u)

/** \brief Length for Ifx_DOM_BRCON_Bits.OLDAEN */
#define IFX_DOM_BRCON_OLDAEN_LEN (1u)

/** \brief Mask for Ifx_DOM_BRCON_Bits.OLDAEN */
#define IFX_DOM_BRCON_OLDAEN_MSK (0x0u)

/** \brief Offset for Ifx_DOM_BRCON_Bits.OLDAEN */
#define IFX_DOM_BRCON_OLDAEN_OFF (0u)

/** \brief Length for Ifx_DOM_BRCON_Bits.FREQDISF */
#define IFX_DOM_BRCON_FREQDISF_LEN (1u)

/** \brief Mask for Ifx_DOM_BRCON_Bits.FREQDISF */
#define IFX_DOM_BRCON_FREQDISF_MSK (0x0u)

/** \brief Offset for Ifx_DOM_BRCON_Bits.FREQDISF */
#define IFX_DOM_BRCON_FREQDISF_OFF (6u)

/** \brief Length for Ifx_DOM_BRCON_Bits.NODELTR */
#define IFX_DOM_BRCON_NODELTR_LEN (1u)

/** \brief Mask for Ifx_DOM_BRCON_Bits.NODELTR */
#define IFX_DOM_BRCON_NODELTR_MSK (0x0u)

/** \brief Offset for Ifx_DOM_BRCON_Bits.NODELTR */
#define IFX_DOM_BRCON_NODELTR_OFF (9u)

/** \brief Length for Ifx_DOM_BRCON_Bits.NORMW */
#define IFX_DOM_BRCON_NORMW_LEN (1u)

/** \brief Mask for Ifx_DOM_BRCON_Bits.NORMW */
#define IFX_DOM_BRCON_NORMW_MSK (0x0u)

/** \brief Offset for Ifx_DOM_BRCON_Bits.NORMW */
#define IFX_DOM_BRCON_NORMW_OFF (10u)

/** \brief Length for Ifx_DOM_BRCON_Bits.MAX_WS */
#define IFX_DOM_BRCON_MAX_WS_LEN (7u)

/** \brief Mask for Ifx_DOM_BRCON_Bits.MAX_WS */
#define IFX_DOM_BRCON_MAX_WS_MSK (0x0u)

/** \brief Offset for Ifx_DOM_BRCON_Bits.MAX_WS */
#define IFX_DOM_BRCON_MAX_WS_OFF (13u)

/** \brief Length for Ifx_DOM_BRCON_Bits.RETRY_CNT */
#define IFX_DOM_BRCON_RETRY_CNT_LEN (4u)

/** \brief Mask for Ifx_DOM_BRCON_Bits.RETRY_CNT */
#define IFX_DOM_BRCON_RETRY_CNT_MSK (0x0u)

/** \brief Offset for Ifx_DOM_BRCON_Bits.RETRY_CNT */
#define IFX_DOM_BRCON_RETRY_CNT_OFF (20u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN0 */
#define IFX_DOM_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN0 */
#define IFX_DOM_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN0 */
#define IFX_DOM_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN1 */
#define IFX_DOM_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN1 */
#define IFX_DOM_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN1 */
#define IFX_DOM_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN2 */
#define IFX_DOM_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN2 */
#define IFX_DOM_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN2 */
#define IFX_DOM_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN3 */
#define IFX_DOM_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN3 */
#define IFX_DOM_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN3 */
#define IFX_DOM_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN4 */
#define IFX_DOM_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN4 */
#define IFX_DOM_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN4 */
#define IFX_DOM_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN5 */
#define IFX_DOM_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN5 */
#define IFX_DOM_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN5 */
#define IFX_DOM_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN6 */
#define IFX_DOM_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN6 */
#define IFX_DOM_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN6 */
#define IFX_DOM_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN7 */
#define IFX_DOM_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN7 */
#define IFX_DOM_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN7 */
#define IFX_DOM_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN8 */
#define IFX_DOM_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN8 */
#define IFX_DOM_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN8 */
#define IFX_DOM_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN9 */
#define IFX_DOM_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN9 */
#define IFX_DOM_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN9 */
#define IFX_DOM_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN10 */
#define IFX_DOM_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN10 */
#define IFX_DOM_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN10 */
#define IFX_DOM_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN11 */
#define IFX_DOM_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN11 */
#define IFX_DOM_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN11 */
#define IFX_DOM_ACCEN0_EN11_OFF (11u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN12 */
#define IFX_DOM_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN12 */
#define IFX_DOM_ACCEN0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN12 */
#define IFX_DOM_ACCEN0_EN12_OFF (12u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN13 */
#define IFX_DOM_ACCEN0_EN13_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN13 */
#define IFX_DOM_ACCEN0_EN13_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN13 */
#define IFX_DOM_ACCEN0_EN13_OFF (13u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN14 */
#define IFX_DOM_ACCEN0_EN14_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN14 */
#define IFX_DOM_ACCEN0_EN14_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN14 */
#define IFX_DOM_ACCEN0_EN14_OFF (14u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN15 */
#define IFX_DOM_ACCEN0_EN15_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN15 */
#define IFX_DOM_ACCEN0_EN15_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN15 */
#define IFX_DOM_ACCEN0_EN15_OFF (15u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN16 */
#define IFX_DOM_ACCEN0_EN16_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN16 */
#define IFX_DOM_ACCEN0_EN16_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN16 */
#define IFX_DOM_ACCEN0_EN16_OFF (16u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN17 */
#define IFX_DOM_ACCEN0_EN17_LEN (1u)

